{
  "PAD_None": 0,
  "BOS_None": 1,
  "EOS_None": 2,
  "MASK_None": 3,
  "Bar_None": 4,
  "Pitch_21": 5,
  "Pitch_22": 6,
  "Pitch_23": 7,
  "Pitch_24": 8,
  "Pitch_25": 9,
  "Pitch_26": 10,
  "Pitch_27": 11,
  "Pitch_28": 12,
  "Pitch_29": 13,
  "Pitch_30": 14,
  "Pitch_31": 15,
  "Pitch_32": 16,
  "Pitch_33": 17,
  "Pitch_34": 18,
  "Pitch_35": 19,
  "Pitch_36": 20,
  "Pitch_37": 21,
  "Pitch_38": 22,
  "Pitch_39": 23,
  "Pitch_40": 24,
  "Pitch_41": 25,
  "Pitch_42": 26,
  "Pitch_43": 27,
  "Pitch_44": 28,
  "Pitch_45": 29,
  "Pitch_46": 30,
  "Pitch_47": 31,
  "Pitch_48": 32,
  "Pitch_49": 33,
  "Pitch_50": 34,
  "Pitch_51": 35,
  "Pitch_52": 36,
  "Pitch_53": 37,
  "Pitch_54": 38,
  "Pitch_55": 39,
  "Pitch_56": 40,
  "Pitch_57": 41,
  "Pitch_58": 42,
  "Pitch_59": 43,
  "Pitch_60": 44,
  "Pitch_61": 45,
  "Pitch_62": 46,
  "Pitch_63": 47,
  "Pitch_64": 48,
  "Pitch_65": 49,
  "Pitch_66": 50,
  "Pitch_67": 51,
  "Pitch_68": 52,
  "Pitch_69": 53,
  "Pitch_70": 54,
  "Pitch_71": 55,
  "Pitch_72": 56,
  "Pitch_73": 57,
  "Pitch_74": 58,
  "Pitch_75": 59,
  "Pitch_76": 60,
  "Pitch_77": 61,
  "Pitch_78": 62,
  "Pitch_79": 63,
  "Pitch_80": 64,
  "Pitch_81": 65,
  "Pitch_82": 66,
  "Pitch_83": 67,
  "Pitch_84": 68,
  "Pitch_85": 69,
  "Pitch_86": 70,
  "Pitch_87": 71,
  "Pitch_88": 72,
  "Pitch_89": 73,
  "Pitch_90": 74,
  "Pitch_91": 75,
  "Pitch_92": 76,
  "Pitch_93": 77,
  "Pitch_94": 78,
  "Pitch_95": 79,
  "Pitch_96": 80,
  "Pitch_97": 81,
  "Pitch_98": 82,
  "Pitch_99": 83,
  "Pitch_100": 84,
  "Pitch_101": 85,
  "Pitch_102": 86,
  "Pitch_103": 87,
  "Pitch_104": 88,
  "Pitch_105": 89,
  "Pitch_106": 90,
  "Pitch_107": 91,
  "Pitch_108": 92,
  "Pitch_109": 93,
  "Velocity_3": 94,
  "Velocity_7": 95,
  "Velocity_11": 96,
  "Velocity_15": 97,
  "Velocity_19": 98,
  "Velocity_23": 99,
  "Velocity_27": 100,
  "Velocity_31": 101,
  "Velocity_35": 102,
  "Velocity_39": 103,
  "Velocity_43": 104,
  "Velocity_47": 105,
  "Velocity_51": 106,
  "Velocity_55": 107,
  "Velocity_59": 108,
  "Velocity_63": 109,
  "Velocity_67": 110,
  "Velocity_71": 111,
  "Velocity_75": 112,
  "Velocity_79": 113,
  "Velocity_83": 114,
  "Velocity_87": 115,
  "Velocity_91": 116,
  "Velocity_95": 117,
  "Velocity_99": 118,
  "Velocity_103": 119,
  "Velocity_107": 120,
  "Velocity_111": 121,
  "Velocity_115": 122,
  "Velocity_119": 123,
  "Velocity_123": 124,
  "Velocity_127": 125,
  "Duration_0.1.8": 126,
  "Duration_0.2.8": 127,
  "Duration_0.3.8": 128,
  "Duration_0.4.8": 129,
  "Duration_0.5.8": 130,
  "Duration_0.6.8": 131,
  "Duration_0.7.8": 132,
  "Duration_1.0.8": 133,
  "Duration_1.1.8": 134,
  "Duration_1.2.8": 135,
  "Duration_1.3.8": 136,
  "Duration_1.4.8": 137,
  "Duration_1.5.8": 138,
  "Duration_1.6.8": 139,
  "Duration_1.7.8": 140,
  "Duration_2.0.8": 141,
  "Duration_2.1.8": 142,
  "Duration_2.2.8": 143,
  "Duration_2.3.8": 144,
  "Duration_2.4.8": 145,
  "Duration_2.5.8": 146,
  "Duration_2.6.8": 147,
  "Duration_2.7.8": 148,
  "Duration_3.0.8": 149,
  "Duration_3.1.8": 150,
  "Duration_3.2.8": 151,
  "Duration_3.3.8": 152,
  "Duration_3.4.8": 153,
  "Duration_3.5.8": 154,
  "Duration_3.6.8": 155,
  "Duration_3.7.8": 156,
  "Duration_4.0.4": 157,
  "Duration_4.1.4": 158,
  "Duration_4.2.4": 159,
  "Duration_4.3.4": 160,
  "Duration_5.0.4": 161,
  "Duration_5.1.4": 162,
  "Duration_5.2.4": 163,
  "Duration_5.3.4": 164,
  "Duration_6.0.4": 165,
  "Duration_6.1.4": 166,
  "Duration_6.2.4": 167,
  "Duration_6.3.4": 168,
  "Duration_7.0.4": 169,
  "Duration_7.1.4": 170,
  "Duration_7.2.4": 171,
  "Duration_7.3.4": 172,
  "Duration_8.0.4": 173,
  "Duration_8.1.4": 174,
  "Duration_8.2.4": 175,
  "Duration_8.3.4": 176,
  "Duration_9.0.4": 177,
  "Duration_9.1.4": 178,
  "Duration_9.2.4": 179,
  "Duration_9.3.4": 180,
  "Duration_10.0.4": 181,
  "Duration_10.1.4": 182,
  "Duration_10.2.4": 183,
  "Duration_10.3.4": 184,
  "Duration_11.0.4": 185,
  "Duration_11.1.4": 186,
  "Duration_11.2.4": 187,
  "Duration_11.3.4": 188,
  "Duration_12.0.4": 189,
  "Position_0": 190,
  "Position_1": 191,
  "Position_2": 192,
  "Position_3": 193,
  "Position_4": 194,
  "Position_5": 195,
  "Position_6": 196,
  "Position_7": 197,
  "Position_8": 198,
  "Position_9": 199,
  "Position_10": 200,
  "Position_11": 201,
  "Position_12": 202,
  "Position_13": 203,
  "Position_14": 204,
  "Position_15": 205,
  "Position_16": 206,
  "Position_17": 207,
  "Position_18": 208,
  "Position_19": 209,
  "Position_20": 210,
  "Position_21": 211,
  "Position_22": 212,
  "Position_23": 213,
  "Position_24": 214,
  "Position_25": 215,
  "Position_26": 216,
  "Position_27": 217,
  "Position_28": 218,
  "Position_29": 219,
  "Position_30": 220,
  "Position_31": 221,
  "PitchDrum_27": 222,
  "PitchDrum_28": 223,
  "PitchDrum_29": 224,
  "PitchDrum_30": 225,
  "PitchDrum_31": 226,
  "PitchDrum_32": 227,
  "PitchDrum_33": 228,
  "PitchDrum_34": 229,
  "PitchDrum_35": 230,
  "PitchDrum_36": 231,
  "PitchDrum_37": 232,
  "PitchDrum_38": 233,
  "PitchDrum_39": 234,
  "PitchDrum_40": 235,
  "PitchDrum_41": 236,
  "PitchDrum_42": 237,
  "PitchDrum_43": 238,
  "PitchDrum_44": 239,
  "PitchDrum_45": 240,
  "PitchDrum_46": 241,
  "PitchDrum_47": 242,
  "PitchDrum_48": 243,
  "PitchDrum_49": 244,
  "PitchDrum_50": 245,
  "PitchDrum_51": 246,
  "PitchDrum_52": 247,
  "PitchDrum_53": 248,
  "PitchDrum_54": 249,
  "PitchDrum_55": 250,
  "PitchDrum_56": 251,
  "PitchDrum_57": 252,
  "PitchDrum_58": 253,
  "PitchDrum_59": 254,
  "PitchDrum_60": 255,
  "PitchDrum_61": 256,
  "PitchDrum_62": 257,
  "PitchDrum_63": 258,
  "PitchDrum_64": 259,
  "PitchDrum_65": 260,
  "PitchDrum_66": 261,
  "PitchDrum_67": 262,
  "PitchDrum_68": 263,
  "PitchDrum_69": 264,
  "PitchDrum_70": 265,
  "PitchDrum_71": 266,
  "PitchDrum_72": 267,
  "PitchDrum_73": 268,
  "PitchDrum_74": 269,
  "PitchDrum_75": 270,
  "PitchDrum_76": 271,
  "PitchDrum_77": 272,
  "PitchDrum_78": 273,
  "PitchDrum_79": 274,
  "PitchDrum_80": 275,
  "PitchDrum_81": 276,
  "PitchDrum_82": 277,
  "PitchDrum_83": 278,
  "PitchDrum_84": 279,
  "PitchDrum_85": 280,
  "PitchDrum_86": 281,
  "PitchDrum_87": 282,
  "PitchDrum_88": 283
}